/**
 * Created by Bezginov.Gleb on 23.01.2017.
 * Задание:
 * 1.	Создать пустой проект в IntelliJ IDEA и прописать метод main();
 * 2.	Создать переменные всех пройденных типов данных, и инициализировать их значения;
 * 3.	Написать метод вычисляющий выражение a * (b + (c / d)) и возвращающий результат, где a,b,c,d – входные параметры этого метода.
 * 4.	Написать метод, принимающий на вход два числа, и проверяющий что их сумма лежит в пределах 10 до 20, если да – вернуть true,
 * в противном случае – false.
 * 5.	Написать метод, который определяет является ли год високосным. Каждый 4-й год является високосным,
 * кроме каждого 100-го, при этом каждый 400-й – високосный.
 *
 */
public class Main {
    public static void main(String[] args) {
        // Примитивные переменные
        // byte, память 8 бит, значения от -128 до 127
        byte a = 1;

        // short
        short b = 2;

        int c = 3;

        long g = 4;



    }
}
