/**
 * Created by Глеб on 25.01.2017.
 *
 *  1 Создать массив, состоящий из элементов 0 и 1, например, int[] arr = { 1, 1, 0, 0, 1, 0, 1, 1, 0, 0 };
 *  2 В массиве из предыдущего пункта с помощью цикла заменить 0 на 1, 1 на 0;
 *  3 Создать массив из 8 целых чисел. С помощью цикла заполнить его значениями 1 4 7 10 13 16 19 22;
 *  4 Задать массив int[] mas = { 1, 5, 3, 2, 11, 4, 5, 2, 4, 8, 9, 1 }; пройти по нему циклом, и числа, которые меньше 6, умножить на 2.
 *  5 Задать одномерный массив и найти в нем минимальный и максимальный элементы;
 *  6 Написать простой консольный калькулятор. Пользователь вводит два числа и операцию, которую хочет выполнить, программа вычисляет результат и выводит в консоль;
 */
public class Main {
    public static void main(String[] args) {
        for (int i =1;i<10; i++){
            System.out.println("i= "+i);
        }
    }
}
